000300 01 MAST-HEADER-REC.
000400    05 HEADER-ACCOUNT-ID                PIC X(12)     .
000500    05 HEADER-RECORD-TYPE               PIC X(4)      .
000600    05 CLIENT-NUMBER                    PIC X(4)      .
000700    05 HEADER-TRANS-ID                  PIC X(8)      .
000800    05 FILE-CREATION-DATE               PIC X(8)      .
000900    05 FILLER                           PIC X(314)    .
001000
